Tekla Open API Reference for Tekla Structures 2025
BendSurface.RotationAxis Property
 Gets the unit vector that defines the rotation axis (for counter clockwise rotations) of the lateral boundaries of the surface. This axis is always parallel to the direction of the center line.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector RotationAxis { get; }
Public ReadOnly Property RotationAxis As Vector
	Get
Property Value
Type: Vector
See Also
Reference
BendSurface Class
Tekla.Structures.Model Namespace